{
  "styles": {},
  "book_hu": {
    "title": {
      "title": "Az igazság az angol igeidőkről",
      "subtitle": "A \"két igeidő\" módszer"
    },
    "copyright": {
      "copyright": "Copyright © 2025 BGDS Minden jog fenntartva.",
      "copyright_text": "A kiadvány bármely részének újranyomása, terjesztése vagy bármilyen formában történő átvétele, beleértve a fénymásolást, felvételt vagy más elektronikus vagy mechanikus módszereket, a kiadó előzetes írásbeli engedélye nélkül tilos, kivéve rövid idézetek esetében kritikai értékelések vagy bizonyos más nem kereskedelmi felhasználások esetén, amelyeket a szerzői jog törvény megenged.",
      "author_text": "Szerző",
      "author": "BGDS",
      "design_text": "Borítóterv és belső elrendezés",
      "design": "BGDS",
      "publish_text": "Kiadja",
      "publish": "BGDS",
      "ISBN_pdf": "ISBN 978 p...",
      "ISBN_epub": "ISBN 978 e...",
      "ISBN_print": "ISBN 978 pr...",
      "printing_text": "Kiadási történet",
      "printing": [
        "2025 július: Első kiadás"
      ],
      "email_text": "Engedélykérésekkel kapcsolatos információkért kérjük, keresse a BGDS-t az alábbi címen",
      "email": "gyorgy.bakocs@transprnt.com"
    },
    "dedicate": {
      "title": "Fiamnak, Alexandernek",
      "content": [
        {
          "type": "paragraph",
          "text": "Egy éves voltál, amikor Malajziába költöztünk és alig négy és fél évesen már angol szövegeket olvastál. A te utad a többnyelvűség felé - ahogy egyszerre sajátítottad el a magyart, angolt, malájt és kínait - példaként szolgálhat minden nyelvtanuló számára, bizonyítva, hogy a fiatal elme milyen hihetetlen teljesítményekre képes."
        },
        {
          "type": "paragraph",
          "text": "A nyelvek iránti lelkesedésed inspirált engem. Kitartásod példa lehet minden nyelvtanulónak. Megmutattad, hogy a nyelvtanulás nem csupán hasznos készség, hanem egy izgalmas kaland is lehet, tele felfedezésekkel és sikerélményekkel."
        },
        {
          "type": "paragraph",
          "text": "Ez a könyv részben a te fejlődésednek köszönhető. Remélem, hogy mások is meríthetnek belőle annyi örömet és sikert a nyelvtanulásban, amennyit te találtál a nyelvek sokszínű világában."
        },
        {
          "type": "paragraph",
          "text": "Büszke vagyok rád, fiam, és köszönöm."
        }
      ]
    },
    "preface": {
      "title": "Bevezetés",
      "content": [
        {
          "type": "paragraph",
          "text": "Kedves Olvasó!"
        },
        {
          "type": "paragraph",
          "text": ""
        },
        {
          "type": "paragraph",
          "text": "Ha valaha is érezte úgy, hogy az angol igeidők egy logikátlan káoszt alkotnak, akkor jó helyen jár! Volt már olyan érzése, hogy a sok szabály és kivétel között azt sem tudja, mikor használjon egy egyszerű múlt időt? Nincs egyedül ezzel – de nyugalom, van megoldás. Azért írtam ezt a könyvet – bár már annyi kiadvány foglalkozik az angol igeidőkkel – hogy képes legyen használni az igeidőket anélkül, hogy a szabályokon rágódna. De mielőtt belekezdenék, engedje meg, hogy bemutatkozzam."
        },
        {
          "type": "paragraph",
          "text": "Bakocs György vagyok, fejlesztőmérnökként dolgozom közel három évtizede. Munkám során csaknem egy évtizedet töltöttem Malajziában, ahol az angol nyelv iránti szenvedélyem kibontakozott. Ennek eredményeként indítottam el egy Instagram- és YouTube-csatornát @aseasyaspie2017 néven. Az Instagram oldalam gyorsan népszerűvé vált, több mint 100 ezer követőt szereztem. Egy technikai malőr miatt elvesztettem a hozzáférésemet a fiókhoz, de @aseasyaspie2021 néven újraindítottam a projektet. Az évek során megszereztem a TEFL (Teaching English as a Foreign Language) tanári képesítést is, mert tudtam: ez az én utam."
        },
        {
          "type": "paragraph",
          "text": "Fiatal koromban a nyelvórákon két nagyon eltérő megközelítéssel találkoztam. Volt egy kiváló tanárom, aki éveket élt Amerikában. Az óráin dalokat fordítottunk, szerepjátékokat játszottunk, és bár néha megemlített egy-egy nyelvtani érdekességet, a lényeg mindig a beszéden volt. Az órák kötetlenek, mégis hatékonyak voltak, a  tudásunk pedig folyamatosan fejlődött. Szerettem az angolt, és még többet akartam tudni. Beiratkoztam az IHLS-be, ahol anyanyelvi tanárok oktattak, és a nyelvi akadályok miatt szó sem lehetett arról, hogy nyelvtani magyarázatokkal terheljenek minket; ehelyett beszéltünk, hallgattunk, és a hibáinkból tanultunk."
        },
        {
          "type": "paragraph",
          "text": "Aztán jött az érettségi éve, és vele egy új tanár. Minden órán újabb és újabb táblázatokat írt a táblára. A present simple használatáról annyi szabályt kellett megtanulnunk, hogy két oldal sem volt elég a füzetben. Mi történt? Ahelyett, hogy spontán beszéltünk volna, folyamatosan a szabályokon agyaltunk. \"Várj... ez most befejezett múlt? Vagy egyszerű? És mi is volt az a harmadik szabály?\" Az órák unalmassá váltak, a lelkesedésünk pedig... nos, mondjuk úgy, hogy mélypontra került."
        },
        {
          "type": "paragraph",
          "text": "A brit iskolákban a nyelvtan oktatása jelentősen eltér a magyar rendszertől. Míg Magyarországon a gyerekek már általános iskolában megismerik az olyan nyelvtani fogalmakat, mint az alany és az állítmány, valamint rendszeresen gyakorolják a mondatértelmezést, addig az angol oktatásban gyakorlatilag nincs hagyományos értelemben vett nyelvtanoktatás. Az angol nemzeti tanterv tartalmaz ugyan bizonyos nyelvtani elemeket, amelyeket integráltan, szövegalkotás és olvasás közben tanítanak. Ezek az elemek kevésbé strukturáltak, mint a magyar rendszerben megszokott nyelvtani elemzések. A diákok irodalmat és fogalmazást tanulnak, de a nyelvtani szabályok részletes magyarázata ritkán kap helyet az oktatásban. A tanárok inkább csak kijavítják a hibákat, de nem tanítják meg a szabályok hátterét."
        },
        {
          "type": "paragraph",
          "text": "Az „angol módszer\" azonban hátrányokkal is járhat. Brit nyelvtanárok szerint megnehezíti a britek számára az idegen nyelvek tanulását, hiszen a saját anyanyelvük szerkezetét sem értik. Egy átlagos brit felnőtt nem tudja elmagyarázni, mi az a főnév vagy melléknév, és fogalma sincs olyan fogalmakról, mint például a phrasal verb. Ironikus módon sok nem angol anyanyelvű jobban tudja az angol nyelvtant, mint maguk a britek. Mégis ők természetesen és magabiztosan használják az angolt, mi pedig – akik a szabályokat kívülről fújjuk – még egy egyszerű mondatnál is elbizonytalanodunk. Ebből is látható, hogy nem az a lényeg, hogy megtanuljuk a szabályokat, hanem az, hogy használni tudjuk őket!"
        },
        {
          "type": "paragraph",
          "text": "Ez a felismerés arra ösztönzött, hogy olyan módszert keressek, amely a szabályok magolása helyett a nyelvhasználatot segíti elő. Egy olyan megközelítést találtam, amely nem a rengeteg igeidőre, nem a száraz szabályokra fókuszál. Nem egy forradalmi újításról van szó, inkább a már létező elméletek leegyszerűsített, gyakorlati változatáról. Hidat épít a nyelvtani szabályok és azok gyakorlati használata között, így az igeidők használata olyan természetessé válik majd az Ön számára, mint egy anyanyelvi beszélőnek."
        },
        {
          "type": "paragraph",
          "text": ""
        },
        {
          "type": "paragraph",
          "text": "Készen áll, hogy együtt fedezzük fel az angol nyelv e gyakran rettegett területét? Ígérem, amikor végzünk, magabiztosan fogja használni az igeidőket! Vágjunk bele!"
        },
        {
          "type": "image",
          "src": "preface.png",
          "alignment": "center",
          "width": "auto",
          "height": "100%",
          "caption": ""
        }
      ]
    },
    "chapters": {
      "ch_1": {
        "title": "1. Túl a szabályokon",
        "type": "simple",
        "content": [
          {
            "type": "paragraph",
            "text": "Mindenekelőtt beszéljünk azokról a kihívásokról, amelyekkel mindannyian szembesülünk a nyelvtanulás során. Már az első lépésnél elakadhatunk: melyik módszert válasszuk? A tanterv szerinti iskolai oktatáson kívül rengeteg különböző módszer létezik. Vannak olyanok, melyek azt ígérik, hogy mindenféle nyelvtani szabály tanulása nélkül is folyékonyan beszélhetünk majd angolul, mert úgy tanulhatunk meg mindent, „mint a kisgyerekek”. Ez valószínűleg nem igaz, de ezek a módszerek közelebb járnak az igazsághoz, mint azok, melyek szerint a nyelvtani szabályok alapos ismerete nélkül lehetetlen jól megtanulni egy nyelvet."
          },
          {
            "type": "paragraph",
            "text": "Nézzünk egy hétköznapi esetet. Amikor az anyuka este megkérdezi: <i>„What did you have for lunch at kindergarten today?” („Mit ebédeltél az oviban?”)</i>, a gyerek gondolkodás nélkül válaszol: <i>„I had some broth.” („Húslevest.”)</i>. A kicsi hallja, hogy a „did” segédigével kérdeztek és ezért a válaszában is a <i>simple past</i> igeidőt fogja használni. Később, amikor az anyuka a vacsoráról érdeklődik: <i>„Have you eaten dinner?” („Vacsoráztál?”)</i>, a gyerek ugyanilyen természetességgel használja a <i>present perfect</i> alakot: <i>„Yes, I've eaten dinner already.” („Igen, már vacsoráztam.”)</i>."
          },
          {
            "type": "paragraph",
            "text": "A kisgyerek ösztönösen érzi a különbséget: az óvodai ebéd egy lezárt múltbeli esemény, míg a vacsora a jelen szempontjából is releváns. Minderre egy nyelvtanuló is rájön magától, ha példákat mutatunk neki, de ő meg fogja kérdezni, hogy miért! Mi, felnőtt nyelvtanulók szeretjük érteni is, amit csinálunk. És ez nem hátrány - épp ellenkezőleg! A logikus gondolkodás, az összefüggések felismerésének képessége olyan előny, amelyet érdemes kihasználnunk a nyelvtanulás során."
          },
          {
            "type": "paragraph",
            "text": "A valódi probléma az, hogy nem rávezetjük a tanulókat a helyes nyelvhasználatra, csak elmondjuk a szabályokat és elvárjuk, hogy használják azokat. De a statisztikák azt mutatják, hogy a nyelvtanulók folyamatosan küzdenek bizonyos szerkezetek helyes használatával. A befejezett igeidők (<i>perfect tenses</i>) okozzák a legtöbb fejtörést - a tanulók több mint 60%-a hibázik a használatukkor, és a diákok 72%-a érzi úgy, hogy a nyelvtani hibáktól való félelem akadályozza őket a beszédben. Mi áll ennek hátterében? <i>Lajtai</i> (2020) részletesen elemzi azt a jelenséget, amikor valaki tudja a szabályokat, de képtelen azokat a gyakorlatban használni. Talán hívhatnánk szabály-paradoxonnak."
          },
          {
            "type": "image",
            "src": "ch1.png",
            "alignment": "center",
            "width": "auto",
            "height": "100%",
            "caption": ""
          }
        ]
      },
      "ch_2": {
        "title": "2. Az igeidők új megközelítése",
        "type": "simple",
        "content": [
          {
            "type": "paragraph",
            "text": "Az előzőekben azt ígértem, hogy nem fogunk nyelvtani szabályokkal szenvedni, hanem példákon keresztül, szinte észrevétlenül fogjuk felfedezni mindazt, amire szükségünk van. Megértjük a nyelvet, létrehozzuk a megfelelő egyszerűsítéseket, a saját modellünket. Tiszteletben tartjuk a többi modellt, de kicsit más úton járva jutunk el az igeidők bonyolultnak tűnő szerkezetének magjához. Tegyük hát ezt!"
          },
          {
            "type": "paragraph",
            "text": "Hány igeidő van valójában az angolban? Egyáltalán mi az az igeidő? A tankönyvekben található igeidő meghatározást mindenki ismeri. És most azt kérem, próbálja ezt elfelejteni, mert ez a meghatározás alapvetően hibás. Amit a tankönyvek igeidőnek neveznek, azok valójában igei szerkezetek. Milyen időben van például az <i>„I sat down.\"</i>? Természetesen mindenki azonnal rávágja, hogy <i>simple past</i>. És mikor azt mondjuk, hogy <i>„I was sitting down, when…\"</i>? A legtöbben azt felelik, hogy <i>past continuous</i>. Pedig ha egy kicsit jobban belegondol, az idő az most is múlt, amit ebben az igei szerkezetben a <i>„be\"</i> múlt idejű alakja a <i>„was\"</i> mutat meg nekünk, míg a cselekvés milyenségét, az ige <i>„ing\"</i> végződése jelzi. Hasonlóan az <i>„I had been sitting down\"</i> esetében is az idő egyszerűen csak múlt, amit a <i>„have\"</i> múlt idejű alakja a <i>„had\"</i> jelez. A befejezettséget (ami nem is az, de most maradjunk ennél) a <i>„been”</i> mutatja, a folyamatosságot pedig ismét az <i>„ing\"</i> végződés."
          },
          {
            "type": "paragraph",
            "text": "Szóval akkor miért hívjuk ezeket az igei szerkezeteket mégis igeidőnek? A válasz egyszerű: az angol nyelvészek másként gondolkodtak, másként rendszerezték a nyelvüket, mint például a mi nyelvészeink. Az angol igeidők első jelentős rendszerezése <i>Lindley Murray</i> nevéhez fűződik, aki 1795-ben publikálta az <i>„English Grammar Adapted to the Different Classes of Learners”</i> című művét. A ma ismert tizenkét igeidős rendszer viszont csak a 19. század végén, 20. század elején vált általánosan elfogadottá. Vagyis mindössze száz-százötven éve kezdték el használni ezt a rendszert a nyelvészek, azért hogy megértsék és lemodellezzék a nyelvet, nem pedig azért, hogy ezek alapján tanítsák. Mi mégis görcsösen ragaszkodunk ehhez a felosztáshoz az oktatásban."
          },
          {
            "type": "paragraph",
            "text": "Két másik meghatározást is adhatunk az igeidő fogalmára:"
          },
          {
            "type": "list",
            "items": [
              {
                "text": "Az egyik a tényleges idő, azaz, hogy a valóságban mikor történik az, amiről beszélünk"
              },
              {
                "text": "A másik a tisztán nyelvtani értelemben vett igeidő."
              }
            ]
          },
          {
            "type": "paragraph",
            "text": "Fontos, hogy különbséget tegyünk a nyelvtani igeidő és a valós világban érzékelt idő között. Sokszor ez nem is olyan egyszerű. Maradjunk annyiban, hogy az igeidő (<i>tense</i>) csak azt határozza meg, milyen alakot vesz fel az ige. És az angol igéknek mindössze két alapvető alakjuk van. Van a múlt (<i>past</i>) és a „nem-múlt” (<i>non-past</i>). Ennyi."
          },
          {
            "type": "paragraph",
            "text": "Érdekes megfigyelni, hogy a magyar nyelvben is csak a múlt időnek van jele. A jövő időt mi is segédigével képezzük. <i>(tanul / tanult / tanulni fog)</i> Ha az előző definíciónk alapján nézzük, akkor nekünk is csak kettő igeidőnk van. (Valójában mi három igeidőt tartunk számon.)"
          },
          {
            "type": "paragraph",
            "text": "A nyelvészek körében egyre elfogadottabb az az új nézet, hogy az angol valójában mindössze két igeidőt használ, amelyeket különböző aspektusokkal és modális segédigékkel kombinál. Bár sok tanár továbbra is a tizenkét igeidős rendszert tanítja, a modern nyelvészet egyre inkább eltávolodik ettől a modelltől, mert nem tükrözi pontosan az angol nyelv valódi működését."
          },
          {
            "type": "textbox",
            "content": [
              {
                "type": "text",
                "text": "Amit a tankönyvek igeidőnek neveznek, azok nem igeidők, hanem igei szerkezetek.",
                "font_weight": "Italic",
                "text_align": "center"
              }
            ],
            "background_color": "ltgrey",
            "border_color": "black",
            "border_width": 1
          },
          {
            "type": "paragraph",
            "text": ""
          },
          {
            "type": "paragraph",
            "text": "Minden igei szerkezet három alapvető nyelvtani építőköve az <i>igeidő (tense)</i>, a <i>mód (mood)</i> és az <i>aspektus (aspect)</i>. Ezek együttesen határozzák meg egy ige állapotát (state). Nézzük meg közelebbről ezt a három összetevőt! Nem elvont elméleti konstrukciókról van szó – ezek azok az elemek, amelyekből minden igei szerkezet felépül:"
          },
          {
            "type": "list",
            "items": [
              {
                "text": "Az <i>idő</i> a cselekvés időbeli elhelyezkedését mutatja meg. Ez a legegyszerűbb a három közül, hiszen – ahogy láttuk – valójában csak két alapvető időnk van: múlt és a nem-múlt."
              },
              {
                "text": "Az <i>aspektus</i> a cselekvés lefolyását, belső időszerkezetét írja le. Folyamatban van? Befejezett? Rendszeresen ismétlődik? Időtlen? Két időpont viszonyára utal?"
              },
              {
                "text": "A <i>mód</i> azt árulja el, hogyan viszonyulunk a cselekvéshez. Tény? Lehetőség? Képesség? Kötelezettség? A módot elsősorban a modális segédigék (can, must, should, would) fejezik ki. A jövő idő kifejezésére használt „will” is egy modális segédige."
              }
            ]
          },
          {
            "type": "paragraph",
            "text": "Ez a megközelítés gyökeresen megváltoztathatja, ahogy az angol nyelvtant tanítjuk és tanuljuk. A következő oldalakon részletesen megvizsgáljuk őket. Nem azért, hogy újabb szabályokat tanuljunk, hanem hogy megértsük: minden igei szerkezet, amit valaha hallott vagy használt az angolban, erre a három pillérre épül. És ha ezt megérti, akkor többé nem kell azon gondolkodnia, melyik „igeidőt” használja. Elég, ha végiggondolja, mit akar kifejezni az <i>idő</i>, a <i>mód</i> és az <i>aspektus</i> szempontjából."
          },
          {
            "type": "paragraph",
            "text": "<b>2.1 Az igeidő (Tense)</b>"
          },
          {
            "type": "paragraph",
            "text": "Már részletesen kitárgyaltuk az előbb. Az igeidő (tense) csak azt határozza meg, milyen alakot vesz fel az ige. És az angol igéknek mindössze két alapvető alakjuk van. Mindez nem azt jelenti, hogy az angol nyelv ne tudná kifejezni a jövőt vagy más időbeli viszonyokat. Dehogynem tudja! Csak éppen más eszközökkel teszi ezt – például segédigékkel vagy a szövegkörnyezettel ás persze az igei szerkezetekkel."
          },
          {
            "type": "paragraph",
            "text": "<b>2.2 Az aspektus (Aspect)</b>"
          },
          {
            "type": "paragraph",
            "text": "Képzeljen el egy kertet! Ha kinéz az ablakon, látja, ahogy a kertész éppen füvet nyír. Ha most valakivel telefonon beszélne, valószínűleg valami ilyesmit mondana:"
          },
          {
            "type": "list",
            "items": [
              {
                "text": "<i>„Nem hallom, a kertész éppen nyírja a füvet.\"</i>"
              },
              {
                "text": "Kicsivel később már így fogalmazna: <i>„Csend van. És micsoda illat! A kertész már lenyírta a füvet.\"</i>"
              },
              {
                "text": "Másnap reggel, ha a barátjának mesélne erről: <i>„Tegnap a kertész lenyírta a füvet.\"</i>"
              },
              {
                "text": "Egy kerti partin, amikor valaki megdicsérné a pázsitot: <i>\"A kertészem minden szombaton lenyírja.\"</i>"
              }
            ]
          },
          {
            "type": "paragraph",
            "text": "Négy különböző mondat, ugyanarról az eseményről – de más nézőpontból. Az elsőben a cselekvés közben látja a kertészt, a másodikban a következményeire utal, a harmadikban egy lezárt eseményt említ, míg az utolsóban a rendszerességre helyezi a hangsúlyt. Ezt a szemléletmódot nevezzük <i>aspektusnak</i>."
          },
          {
            "type": "paragraph",
            "text": "Az aspektus tehát nem azt mondja meg, hogy <i>mikor</i> történt valami, hanem azt, hogy <i>hogyan</i> látjuk az adott eseményt. Ez egy nagyon fontos különbség. Az időpont (<i>mikor?</i>) és a szemléletmód (<i>hogyan?</i>) két teljesen különböző dolog. Nem győzöm hangsúlyozni, hogy éppen ezért félrevezető az a hagyományos megközelítés, amely az aspektust az igeidő részeként kezeli, mintha a <i>simple present</i>, a <i>present continuous</i> vagy a <i>present perfect</i> különböző időpontokat jelölnének."
          },
          {
            "type": "paragraph",
            "text": "Az angol nyelv három fő aspektust különböztet meg: az <i>egyszerű (simple)</i>, a <i>folyamatos (progressive/continuous)</i> és a <i>befejezett (perfect)</i> aspektust."
          },
          {
            "type": "paragraph",
            "text": "<b>2.2.1 A Perfect aspektus természete</b>"
          },
          {
            "type": "paragraph",
            "text": "Egy esemény néha nem csak önmagában fontos. Ilyenkor nem egyszerűen arról van szó, hogy valami megtörtént, hanem arról is, hogy ennek hatása még most is érezhető. A <i>perfect aspektus</i> nem egy időpontra fókuszál, hanem arra, hogy egy esemény hogyan kapcsolódik egy másik időponthoz. Tetten érhető egy egyszerű logika: Valami történt egy másik időpont előtt, és ennek van jelentősége. A <i>perfect</i> mindig két időpont kapcsolatáról szól, még akkor is, ha elsőre nehéz észrevenni mindkettőt."
          },
          {
            "type": "paragraph",
            "text": "Vannak helyzetek tehát, amikor nem maga az esemény fontos, hanem az eredménye. Ha elvesztette a kulcsait, az nemcsak azt a tényt jelenti, hogy elvesztette őket, hanem azt is, hogy még most sincsenek meg. Lehet, hogy éppen most ért véget az esemény, de az is lehet, hogy régen. Nem számít."
          },
          {
            "type": "list",
            "items": [
              {
                "text": "<i>I have lost my keys.</i> – még most is keresem őket"
              },
              {
                "text": "<i>She has just finished her homework.</i> – most csukta be a füzetet"
              },
              {
                "text": "<i>Have you seen my phone?</i> – ha látta, akkor talán meg tudja mondani, hol van most"
              }
            ]
          },
          {
            "type": "paragraph",
            "text": "Máskor az számít, hogy egy esemény valaha megtörtént-e, nem pedig az, hogy pontosan mikor. Ha megkérdezi valakitől, hogy járt-e már Párizsban, a kérdés nem az időpontra vonatkozik, hanem arra, hogy volt-e ilyen tapasztalata. Ezeknek a mondatoknak lényege éppen az, hogy a teljes élettapasztalatra utalnak, ami összeköti a múltat a jelennel."
          },
          {
            "type": "list",
            "items": [
              {
                "text": "<i>Have you ever been to Paris?</i> – az élet bármely pontján szerzett tapasztalatra kérdez rá, és a \"valaha\" időtartamot foglalja magában"
              },
              {
                "text": "<i>I have never eaten oysters.</i> – arra utal, hogy egész életemben, a jelen pillanatig bezárólag soha nem volt ilyen tapasztalatom"
              },
              {
                "text": "<i>She has driven a truck before.</i>"
              }
            ]
          },
          {
            "type": "paragraph",
            "text": "Előfordul olyan is, hogy az esemény a múltban kezdődött, de még most is tart. Ha valaki tíz éve költözött egy városba, és még mindig ott él, akkor ezt nem egy befejezett múltbeli esemény, hanem egy állapot."
          },
          {
            "type": "list",
            "items": [
              {
                "text": "<i>He has lived here for 10 years</i> – múltban kezdődött, de a jelenben is fennálló helyzet"
              },
              {
                "text": "<i>You have known her since childhood.</i>"
              },
              {
                "text": "<i>I have owned this car for years.</i>"
              }
            ]
          },
          {
            "type": "paragraph",
            "text": "A fenti helyzetekben a közös az, hogy találunk bennük két időpontot és egy eredményt. Az korábbi időpontban valami történt (vagy elkezdődött), ami a későbbi időpontra hatással van. Például kész a lecke, fogalmunk sincsen az osztriga ízéről, évek óta ugyanazzal az autóval járunk. Én ezt <i>„before logikának”</i> hívom."
          },
          {
            "type": "paragraph",
            "text": "A <i>perfect aspektus</i> kifejezésére mindig ugyanazt a szerkezetet használjuk: a <i>„have” segédige</i> megfelelő alakját és az ige harmadik alakját (<i>past participle</i>) kombináljuk. Az igei szerkezet logikája nagyon egyszerű. A szerkezet első eleme megmutatja az időt, a második pedig a <i>perfect</i> aspektust."
          },
          {
            "type": "paragraph",
            "text": "<i>have + past participle</i>"
          },
          {
            "type": "list",
            "items": [
              {
                "text": "<i>I have lost my keys.</i>",
                "sub_items": [
                  "Az igei szerkezet első tagja a <i>„have\"</i> jelen idejű alakja. – Az igeidő: <i>present</i>",
                  "A szerkezet második tagja <i>past participle</i> („lost\"). – Az aspektus: <i>perfect</i>",
                  "A <i>„present perfect\"</i> a tankönyvi igeidő."
                ]
              },
              {
                "text": "<i>I had already lost my keys, when he asked.</i>",
                "sub_items": [
                  "Múlt idő, hiszen a <i>„have\"</i> múlt idejű alakját látjuk („had\"). – Az igeidő: <i>past</i>",
                  "A szerkezet második tagja most is <i>past participle</i> („lost\"). – Az aspektus: <i>perfect</i>",
                  "Ha a tankönyvi igeidőt szeretnénk megnevezni, akkor ez <i>„past perfect\"</i>."
                ]
              }
            ]
          }
        ]
      },
      "ch_3": {
        "title": "",
        "type": "simple",
        "content": [
        ]
      }
    }
  },
  "book_en": {
    "title": {
      "title": "The Truth About English Tenses",
      "subtitle": "The Two Tenses Magic"
    },
    "copyright": {
      "copyright_text": "Copyright © 2025 by BGDS All rights reserved.",
      "copyright_text": "No part of this publication may be reproduced, distributed, or transmitted in any form or by any means, including photocopying, recording, or other electronic or mechanical methods, without the prior written permission of the publisher, except in the case of brief quotations embodied in critical reviews and certain other noncommercial uses permitted by copyright law.",
      "author_text": "Author",
      "author": "BGDS",
      "design_text": "Cover design and interior layout",
      "design": "BGDS",
      "publish_text": "Published",
      "publish": "BGDS",
      "ISBN_pdf": "ISBN 978 p...",
      "ISBN_epub": "ISBN 978 e...",
      "ISBN_print": "ISBN 978 pr...",
      "printing_text": "Release History",
      "printing": [
        "July 2025: First Edition"
      ],
      "email_text": "For permissions requests, please contact BGDS at the following address",
      "email": "gyorgy.bakocs@transprnt.com"
    },
    "dedicate": {
      "title": "To my son, Alexander",
      "content": [
        {
          "type": "paragraph",
          "text": "You were just one year old when we moved to Malaysia, and by the age of four and a half, you were already reading English texts. Your journey toward multilingualism—mastering Hungarian, English, Malay, and Chinese all at once—stands as an inspiring example for any language learner, proving the remarkable potential of a young mind."
        },
        {
          "type": "paragraph",
          "text": "Your passion for languages inspired me. Your perseverance is a model for every learner, showing that language learning isn't just a useful skill, but a thrilling adventure filled with discoveries and moments of triumph."
        },
        {
          "type": "paragraph",
          "text": "This book owes part of its existence to your journey. I hope it brings others as much joy and success in language learning as you've found in the colorful world of languages."
        },
        {
          "type": "paragraph",
          "text": "I'm proud of you, my son. Thank you."
        }
      ]
    },
    "preface": {
      "title": "Preface",
      "content": [
        {
          "type": "paragraph",
          "text": "Dear Reader"
        },
        {
          "type": "paragraph",
          "text": ""
        },
        {
          "type": "paragraph",
          "text": "This book is written in clear and simple English, so that beginner and intermediate learners can understand it easily. Don’t worry if you don’t understand every word. Just keep reading — you will improve step by step!"
        },
        {
          "type": "paragraph",
          "text": ""
        },
        {
          "type": "paragraph",
          "text": "Have you ever felt that English tenses form an illogical chaos? Then you are in the right place! Have you ever had the feeling that among all the rules and exceptions, you don’t even know when to use a simple past tense? You are not alone – but don’t worry, there is a solution. I wrote this book – even though many books already deal with English tenses – so that you can use tenses without getting stuck on the rules. But before we begin, let me introduce myself."
        },
        {
          "type": "paragraph",
          "text": "My name is György Bakocs, and I’ve been working as a development engineer for nearly thirty years. During my career, I spent almost ten years in Malaysia, where my passion for the English language really grew. As a result, I started an Instagram and YouTube channel called @aseasyaspie2017. My Instagram page quickly became popular, and I gained more than 100,000 followers. Because of a technical problem, I lost access to the account, but I restarted the project under the name @aseasyaspie2021. Over the years, I also got a TEFL (Teaching English as a Foreign Language) certificate, because I knew: this is my path."
        },
        {
          "type": "paragraph",
          "text": "When I was young, I had two very different types of English lessons. I had an excellent teacher who had lived in America. In her classes, we translated songs, played role-playing games, and although she sometimes mentioned grammar rules, the focus was always on speaking. The classes were relaxed but effective, and we improved all the time. I loved English and wanted to learn more. I enrolled at IHLS, where native speakers taught us. Because of the language barrier, they didn’t give us grammar explanations; instead, we spoke, listened, and learned from our mistakes."
        },
        {
          "type": "paragraph",
          "text": "Then came the year of the final exam, and a new teacher. Every lesson, she wrote more and more tables on the board. We had to learn so many rules about using the present simple tense that even two notebook pages were not enough. What happened? Instead of speaking freely, we kept thinking about the rules. “Wait... is this present perfect? Or simple past? And what was that third rule again?” The lessons became boring, and our motivation... well, let’s just say it hit the bottom."
        },
        {
          "type": "paragraph",
          "text": "Grammar teaching in British schools is very different from the Hungarian system. In Hungary, children learn grammar concepts like subject and predicate already in primary school, and they regularly practise sentence analysis. In British education, there is almost no traditional grammar teaching. The national curriculum includes some grammar elements, but these are taught during writing and reading activities, not as a separate subject. These elements are less structured than the grammar analysis we know from Hungarian schools. Students learn literature and composition, but they don’t get much detailed grammar explanation. Teachers often just correct the mistakes but don’t explain the reasons behind them."
        },
        {
          "type": "paragraph",
          "text": "However, the “English method” also has its downsides. According to British language teachers, it makes it harder for British people to learn foreign languages, because they don’t understand the structure of their own language. An average British adult cannot explain what a noun or adjective is and has no idea what a phrasal verb means. Ironically, many non-native speakers know English grammar better than the British themselves. Still, native speakers use English naturally and with confidence, while we – who know all the rules – hesitate even with simple sentences. This shows that the point is not to learn all the rules, but to be able to use them!"
        },
        {
          "type": "paragraph",
          "text": "This realisation made me look for a method that supports language use instead of memorising rules. I found an approach that does not focus on many different tenses or dry grammar explanations. It’s not a revolutionary method, but a simplified and practical version of existing ideas. It builds a bridge between grammar rules and real usage, so tenses will become as natural to you as they are to native speakers."
        },
        {
          "type": "paragraph",
          "text": ""
        },
        {
          "type": "paragraph",
          "text": "Are you ready to explore this often-feared part of the English language with me? I promise that when we’re done, you will be able to use tenses with confidence! Let’s get started!"
        },
        {
          "type": "image",
          "src": "preface.png",
          "alignment": "center",
          "width": "auto",
          "height": "100%",
          "caption": ""
        }
      ]
    },
    "chapters": {
      "ch1": {
        "title": "1. Beyond the Rules",
        "type": "simple",
        "content": [
          {
            "type": "paragraph",
            "text": "First, let’s talk about the challenges we all face when learning a language. We can get stuck right at the beginning: which method should we choose? Besides regular school education, there are many different methods. Some of them promise that we can speak English fluently without learning grammar rules — because we can learn everything <i>\"like small children.\"</i> This is probably not true, but these methods are closer to the truth than those that say it is impossible to learn a language without knowing the rules very well."
          },
          {
            "type": "paragraph",
            "text": "Let’s look at a simple, everyday situation. When a mother asks in the evening, <i>\"What did you have for lunch at kindergarten today?\"</i>, the child answers without thinking: <i>\"I had some broth.\"</i> The child hears the question with \"did\", so they use the <i>simple past tense</i> in the answer. Later, when the mother asks about dinner — <i>\"Have you eaten dinner?\"</i> — the child answers just as naturally with <i>present perfect</i>: <i>\"Yes, I’ve eaten dinner already.\"</i>"
          },
          {
            "type": "paragraph",
            "text": "The child can feel the difference: lunch at kindergarten is a finished event in the past, but dinner is still important now, in the present. A language learner can also understand this if we show them examples — but they will ask: <i>why?</i> We, as adult learners, like to understand what we are doing. And that is not a weakness — it’s a strength! Logical thinking and seeing patterns are useful skills, and we should use them when learning a language."
          },
          {
            "type": "paragraph",
            "text": "The real problem is that we often don’t guide learners toward correct language use. We only tell them the rules and expect them to use them. But statistics show that learners often struggle with certain grammar forms. The <i>perfect tenses</i> cause the most problems — more than 60% of learners make mistakes when using them, and 72% of students say they are afraid to speak because they might make grammar mistakes. Why does this happen? <i>Lajtai</i> (2020) explains this problem in detail: sometimes people know the rules, but can’t use them. Maybe we can call this the <i>rule paradox</i>."
          },
          {
            "type": "image",
            "src": "ch1.png",
            "alignment": "center",
            "width": "auto",
            "height": "100%",
            "caption": ""
          }
        ]
      },
      "ch_2": {
        "title": "2. A New Approach to Tenses",
        "type": "simple",
        "content": [
          {
            "type": "paragraph",
            "text": "Earlier, I promised that we wouldn't struggle with grammar rules, but that we would discover everything we need through examples, almost without noticing. We will understand the language, make useful simplifications, and build our own model. We will respect other models, but by going a slightly different way, we will reach the core of the tense system, which only seems complex. Let’s do this!"
          },
          {
            "type": "paragraph",
            "text": "How many tenses are there in English, really? And what is a tense anyway? Everyone knows the definition of tense from textbooks. And now I ask you to try to forget that definition, because it is basically incorrect. What textbooks call tenses are actually verb structures. For example, what tense is <i>“I sat down”</i>? Of course, most people will quickly say: <i>simple past</i>. And when we say <i>“I was sitting down, when…”</i>? Most people will answer: <i>past continuous</i>. But if you think about it more, the time is still past. This is shown in this verb structure by the past form of <i>“be”</i> – which is <i>“was”</i>. The type of action is shown by the <i>“-ing”</i> ending of the verb. It is similar with <i>“I had been sitting down”</i> – here the time is also simply past, which we see from the past form of <i>“have”</i> – <i>“had”</i>. The idea of completeness (which is not exactly that, but let’s stay with this word for now) is shown by <i>“been”</i>, and the continuous action again by the <i>“-ing”</i> ending."
          },
          {
            "type": "paragraph",
            "text": "So why do we still call these verb structures tenses? The answer is simple: English linguists thought differently. They organized their language differently than, for example, our linguists did. The first important system of English tenses was made by <i>Lindley Murray</i>, who published his book <i>“English Grammar Adapted to the Different Classes of Learners”</i> in 1795. The twelve-tense system we know today only became generally accepted at the end of the 19th century and the beginning of the 20th century. This means that linguists have only used this system for about 100–150 years. They created it to understand and describe the language, not to teach it. Still, we strongly stick to this system in education."
          },
          {
            "type": "paragraph",
            "text": "We can give two other definitions for the word “tense”:"
          },
          {
            "type": "list",
            "items": [
              {
                "text": "One is the real time — meaning, when something happens in reality."
              },
              {
                "text": "The other is grammatical tense — how the verb shows time in grammar."
              }
            ]
          },
          {
            "type": "paragraph",
            "text": "It is important to make a difference between grammatical tense and the time we feel in the real world. Often, this is not easy. Let’s just say for now that <i>tense</i> only shows what form the verb takes. And English verbs have only two basic forms. There is <i>past</i> and <i>non-past</i>. That’s all."
          },
          {
            "type": "paragraph",
            "text": "It is interesting to see that in Hungarian, only the past tense has a special ending. We also use an extra verb to show the future (like in <i>“tanul / tanult / tanulni fog”</i>). If we use the same definition as above, then we also have only two tenses in Hungarian. (But we usually say we have three.)"
          },
          {
            "type": "paragraph",
            "text": "Among linguists, the idea is becoming more popular that English really uses only two tenses, and builds everything else with <i>aspects</i> and <i>modal auxiliary verbs</i>. Even though many teachers still teach the twelve-tense system, modern linguistics is moving away from it — because it does not show how English really works."
          },
          {
            "type": "textbox",
            "content": [
              {
                "type": "text",
                "text": "What textbooks call tenses are not tenses, but verb structures.",
                "font_weight": "Italic",
                "text_align": "center"
              }
            ],
            "background_color": "ltgrey",
            "border_color": "black",
            "border_width": 1
          },
          {
            "type": "paragraph",
            "text": "Every verb structure has three basic grammar parts: <i>tense</i>, <i>mood</i>, and <i>aspect</i>. These three things together show the <i>state</i> of a verb. Let’s look more closely at these three parts! These are not abstract or difficult grammar ideas — they are real tools. These are the pieces that build every verb structure:"
          },
          {
            "type": "list",
            "items": [
              {
                "text": "<i>Tense</i> shows when the action happens. This is the easiest of the three. As we said, there are only two basic tenses: past and non-past."
              },
              {
                "text": "<i>Aspect</i> describes how the action happens over time. Is it in progress? Is it finished? Does it happen regularly? Is it timeless? Does it connect two moments in time?"
              },
              {
                "text": "<i>Mood</i> shows how we feel about the action. Is it a fact? A possibility? An ability? A duty? Mood is usually shown with modal verbs (like can, must, should, would). The word “will”, which we use to show future, is also a modal verb."
              }
            ]
          },
          {
            "type": "paragraph",
            "text": "This way of thinking can completely change how we teach and learn English grammar. In the next pages, we will look at these parts in detail. Not to learn more rules, but to understand this: every verb structure you have ever heard or used in English is built on these three pillars. And if you understand them, you will not have to worry about which “tense” to use. It will be enough to think about what you want to express in terms of <i>tense, mood, and aspect</i>."
          },
          {
            "type": "paragraph",
            "text": "<b>2.1 Tense</b>"
          },
          {
            "type": "paragraph",
            "text": "We already talked about this in detail earlier. Tense only shows what form the verb takes. And English verbs have only two basic forms. This doesn’t mean that the English language cannot express the future or other time relationships. Of course it can! It just uses different tools to do this – for example, auxiliary verbs, the context, and of course verb structures."
          },
          {
            "type": "paragraph",
            "text": "<b>2.2 Aspect</b>"
          },
          {
            "type": "paragraph",
            "text": "Imagine a garden! If you look out the window, you see the gardener cutting the grass. If you were talking to someone on the phone right now, you would probably say something like:"
          },
          {
            "type": "list",
            "items": [
              {
                "text": "<i>“I can't hear you, the gardener is cutting the grass right now.”</i>"
              },
              {
                "text": "A little later, you would say it this way: <i>“It’s quiet. And what a smell! The gardener has already cut the grass.”</i>"
              },
              {
                "text": "The next morning, if you were telling your friend about it: <i>“Yesterday the gardener cut the grass.”</i>"
              },
              {
                "text": "At a garden party, when someone compliments the lawn: <i>“My gardener cuts it every Saturday.”</i>"
              }
            ]
          },
          {
            "type": "paragraph",
            "text": "Four different sentences about the same event – but from different points of view. In the first, you see the gardener in the middle of the action. In the second, you talk about the result. In the third, you mention a finished event. In the last one, you focus on how often it happens. This way of thinking is what we call <i>aspect</i>."
          },
          {
            "type": "paragraph",
            "text": "So <i>aspect</i> does not tell us when something happened, but how we see the event. This is a very important difference. The time (<i>when?</i>) and the way we see it (<i>how?</i>) are two completely different things. I want to make it very clear that this is why the traditional method – which treats <i>aspect</i> as part of <i>tense</i> – is not correct. It makes it look like <i>simple present</i>, <i>present continuous</i>, or <i>present perfect</i> talk about different times."
          },
          {
            "type": "paragraph",
            "text": "The English language shows three main aspects: the <i>simple</i>, the <i>progressive/continuous</i>, and the <i>perfect aspect</i>."
          }
        ]
      },
      "ch_3": {
        "title": "",
        "type": "simple",
        "content": [
        ]
      }
    }
  }
}
